package lesson_one.hw.tasks_for;

/*
 * Напишите программу, которая выводит все числа от 1 до 10.
 * */

public class TaskOne {
    public static void main(String[] args) {
        for (int i = 1; i <= 10; i++) {
            System.out.print(i + " ");
        }
    }
}
